In [1]:
import numpy as np
import pandas as pd

In [2]:
data = {
    'Date': ['2024-01-01', '2024-01-02', '2024-01-03', '2024-01-04', '2024-01-05',
             '2024-01-06', '2024-01-07', '2024-01-08', '2024-01-09', '2024-01-10',
             '2024-01-11', '2024-01-12', '2024-01-13', '2024-01-14', '2024-01-15',
             '2024-01-16', '2024-01-17', '2024-01-18', '2024-01-19', '2024-01-20'],
    'Product': ['Product A', 'Product B', 'Product A', 'Product C', 'Product B',
                'Product A', 'Product D', 'Product C', 'Product B', 'Product A',
                'Product C', 'Product A', 'Product B', 'Product D', 'Product A',
                'Product C', 'Product B', 'Product A', 'Product D', 'Product C'],
    'Quantity': [10, 15, 7, 12, 5,
                 8, 6, 14, 3, 9,
                 11, 4, 13, 7, 10,
                 8, 2, 5, 6, 10],
    'Revenue': [100, 150, 70, 120, 50,
                80, 60, 140, 30, 90,
                110, 40, 130, 70, 100,
                80, 20, 50, 60, 100],
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve',
             'Frank', 'Grace', 'Hank', 'Ivy', 'Jack',
             'Kelly', 'Liam', 'Mona', 'Nate', 'Olivia',
             'Paul', 'Quincy', 'Rita', 'Steve', 'Tina']
}

# Create DataFrame
sales_df = pd.DataFrame(data)

print(sales_df)

          Date    Product  Quantity  Revenue     Name
0   2024-01-01  Product A        10      100    Alice
1   2024-01-02  Product B        15      150      Bob
2   2024-01-03  Product A         7       70  Charlie
3   2024-01-04  Product C        12      120    David
4   2024-01-05  Product B         5       50      Eve
5   2024-01-06  Product A         8       80    Frank
6   2024-01-07  Product D         6       60    Grace
7   2024-01-08  Product C        14      140     Hank
8   2024-01-09  Product B         3       30      Ivy
9   2024-01-10  Product A         9       90     Jack
10  2024-01-11  Product C        11      110    Kelly
11  2024-01-12  Product A         4       40     Liam
12  2024-01-13  Product B        13      130     Mona
13  2024-01-14  Product D         7       70     Nate
14  2024-01-15  Product A        10      100   Olivia
15  2024-01-16  Product C         8       80     Paul
16  2024-01-17  Product B         2       20   Quincy
17  2024-01-18  Product A         5       50     Rita
18  2024-01-19  Product D         6       60    Steve
19  2024-01-20  Product C        10      100     Tina

In [ ]:
#select first 7 rows using iloc

In [ ]:
#select the first 7 rows and the first 3 columns using iloc function

In [3]:
sale2=sales_df.copy()

In [4]:
sale2.set_index("Name",inplace=True)

In [5]:
print(sale2)

               Date    Product  Quantity  Revenue
Name
Alice    2024-01-01  Product A        10      100
Bob      2024-01-02  Product B        15      150
Charlie  2024-01-03  Product A         7       70
David    2024-01-04  Product C        12      120
Eve      2024-01-05  Product B         5       50
Frank    2024-01-06  Product A         8       80
Grace    2024-01-07  Product D         6       60
Hank     2024-01-08  Product C        14      140
Ivy      2024-01-09  Product B         3       30
Jack     2024-01-10  Product A         9       90
Kelly    2024-01-11  Product C        11      110
Liam     2024-01-12  Product A         4       40
Mona     2024-01-13  Product B        13      130
Nate     2024-01-14  Product D         7       70
Olivia   2024-01-15  Product A        10      100
Paul     2024-01-16  Product C         8       80
Quincy   2024-01-17  Product B         2       20
Rita     2024-01-18  Product A         5       50
Steve    2024-01-19  Product D         6       60
Tina     2024-01-20  Product C        10      100

**answer all the following questions based on** ***sale2*** **dataframe**

In [ ]:
#select the first 5 rows from sale2 using loc function

In [ ]:
#select the first 5 rows from sale2 using iloc function

In [ ]:
#select the first 5 rows along with product and reveneu column using loc function

In [ ]:
#select the first 5 rows along with product and reveneu column using iloc function

dataframe filtering

In [ ]:
#find all rows where quantity is greater than 10

In [34]:
#find all rows where revenue is between than 50 and 100 (inclusive of both ends)

In [33]:
#find all rows where date is between 2024-01-07 and 2024-01-18 (inclusive of both ends)

**apply function**

In [ ]:
def sq(x):
  return x**2

In [ ]:
#convert values in revenue into their square using apply function and the above "sq" function
sale2["Revenue"]=#your code